ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
/**
  **************************************************************************
  * @file     cf.c
  * @brief    xmc pc card program
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "cf.h"
#include "at32f403.h"
#include "at32f403_board.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/** @addtogroup AT32F403_periph_examples
  * @{
  */

/** @addtogroup XMC_CF_CARD
  * @{
  */

dma_init_type DMA_InitStructure;
u16 DMA1_MEM_LEN;
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup PCCARD_Private_Constants PCCARD Private Constants
  * @{
  */

#define PCCARD_TIMEOUT_READ_ID      (uint32_t)0x0000FFFF
#define PCCARD_TIMEOUT_SECTOR       (uint32_t)0x0000FFFF
#define PCCARD_TIMEOUT_STATUS       (uint32_t)0x01000000

#define PCCARD_STATUS_OK            (uint8_t)0x58
#define PCCARD_STATUS_WRITE_OK      (uint8_t)0x50
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/

/** @defgroup PCCARD_Exported_Functions PCCARD Exported Functions
  * @{
  */

/** @defgroup PCCARD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @brief    Initialization and Configuration functions
  *
  @verbatim
  ==============================================================================
          ##### PCCARD Initialization and de-initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to initialize/de-initialize
    the PCCARD memory

@endverbatim
  * @{
  */
  /**
  * @brief  DMA configuration
  * @param  EDMA_CHx: pointer to a EDMA_Channel_Type structure
  * @param  cpar_src: the Memory 1 addr
  * @param  cmar_dst: the Memory 2 addr
  * @param  cndtr: transfer size
  * @param  Transfer_Type: 
  *     @arg Read_Transfer: from Memory 1 to Memory 2
  *     @arg Write_Transfer: from Memory 2 to Memory 1
  * @param  Transfer_Width: BYTE or HALFWORD
  * @retval None
  */
void MYDMA_Config(dma_channel_type* DMAy_channelx, uint32_t cpar_src, uint32_t cmar_dst, uint32_t cndtr, uint8_t Transfer_Type, uint8_t Transfer_Width)
{
  dma_init_type  DMA_InitStruct;
  crm_periph_clock_enable(CRM_DMA1_PERIPH_CLOCK, TRUE);

  dma_reset(DMAy_channelx);

  if(Transfer_Type == Read_Transfer)
  {
    DMA_InitStruct.peripheral_inc_enable = FALSE;
    DMA_InitStruct.memory_inc_enable = TRUE;
  }
  else
  {
    DMA_InitStruct.peripheral_inc_enable = TRUE;
    DMA_InitStruct.memory_inc_enable = FALSE;
  }

  if(Transfer_Width == Enable_8_bit_Transfer)
  {
    DMA_InitStruct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_BYTE;
    DMA_InitStruct.memory_data_width = DMA_MEMORY_DATA_WIDTH_BYTE;
  }
  else
  {
    DMA_InitStruct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_HALFWORD;
    DMA_InitStruct.memory_data_width = DMA_MEMORY_DATA_WIDTH_HALFWORD;
  }

  DMA_InitStruct.direction = DMA_DIR_MEMORY_TO_MEMORY;
  DMA_InitStruct.buffer_size = cndtr;
  DMA_InitStruct.peripheral_base_addr = cpar_src;

  DMA_InitStruct.memory_base_addr = cmar_dst;

  DMA_InitStruct.loop_mode_enable = FALSE;
  DMA_InitStruct.priority = DMA_PRIORITY_MEDIUM;
  dma_init(DMAy_channelx,&DMA_InitStruct);
 
  
  dma_channel_enable(DMAy_channelx, TRUE);
}
/**
  * @brief  XMC InitCtrl
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Init: pointer to a XMC_PCCARDInitType structure
  * @param  Set_reg_8_bit: choose 8/16bit
  * @retval STATUS_OK or STATUS_ERROR
  */
StatusType XMC_PCCARD_InitCtrl(xmc_bank4_type *Device, xmc_pccard_init_type *Init, uint8_t Set_reg_8_bit)
{
  if(Set_reg_8_bit == 1)
  {
   Device->bk4ctrl_bit.extmdbw = 0x0;
  }
  else
  {
   Device->bk4ctrl_bit.extmdbw = 0x1;
  }
   
  Device->bk4ctrl_bit.tar = Init->delay_time_ar;
  Device->bk4ctrl_bit.tcr = Init->delay_time_cr;

  return STATUS_OK;

}
/**
  * @brief  XMC Enable Wait Feature
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Init: pointer to a XMC_PCCARDInitType structure
  * @retval STATUS_OK or STATUS_ERROR
  */
StatusType XMC_Enable_Wait_Feature(xmc_bank4_type *Device, xmc_pccard_init_type *Init)
{
 
 Device->bk4ctrl_bit.nwen = Init->enable_wait;

  return STATUS_OK;
}
/**
  * @brief  Set 16bit_Feature
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Init: pointer to a XMC_PCCARDInitType structure
  * @param  Set_reg_8_bit: choose 8/16bit
  * @retval HAL status
  */
StatusType XMC_Enable_16bit_Feature(xmc_bank4_type *Device, xmc_pccard_init_type *Init, uint8_t Set_reg_8_bit)
{
  if(Set_reg_8_bit == 1)
  {
   Device->bk4ctrl_bit.extmdbw = 0x0;
  }
  else
  {
   Device->bk4ctrl_bit.extmdbw = 0x1;
  }

  return STATUS_OK;
}
/**
  * @brief  Init CommonSpace Timing
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Timing: pointer to a Common space timing structure
  * @retval HAL status
  */
StatusType XMC_PCCARD_InitCommonSpaceTiming(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
 Device->bk4tmgmem_bit.cmdhizt = Timing->mem_hiz_time;
 Device->bk4tmgmem_bit.cmht = Timing->mem_hold_time;
 Device->bk4tmgmem_bit.cmst = Timing->mem_setup_time;
 Device->bk4tmgmem_bit.cmwt = Timing->mem_waite_time;

  return STATUS_OK;
}
/**
  * @brief  Init AttributeSpace Timing
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Timing: pointer to a Attribute space timing structure
  * @retval HAL status
  */
StatusType XMC_PCCARD_InitAttributeSpaceTiming(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
  Device->bk4tmgatt_bit.amdhizt = Timing->mem_hiz_time;
  Device->bk4tmgatt_bit.amht = Timing->mem_hold_time;
  Device->bk4tmgatt_bit.amst = Timing->mem_setup_time;
  Device->bk4tmgatt_bit.amwt = Timing->mem_waite_time;
  return STATUS_OK;
}
/*****************************************************************/
/**
  * @brief  Init IOSpace Timing
  * @param  Device: pointer to a XMC_Bank4_Type structure
  * @param  Timing: pointer to a IO space timing structure
  * @retval HAL status
  */
StatusType XMC_PCCARD_InitIOSpaceTiming(xmc_bank4_type *Device, xmc_nand_pccard_timinginit_type *Timing)
{
 
