ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  Device->bk4tmgio_bit.iohizt = Timing->mem_hiz_time;
  Device->bk4tmgio_bit.ioht = Timing->mem_hold_time;
  Device->bk4tmgio_bit.iost = Timing->mem_setup_time;
  Device->bk4tmgio_bit.iowt = Timing->mem_waite_time;

  return STATUS_OK;
}
/*****************************************************************/
/**
  * @brief  Perform the PCCARD memory Initialization sequence
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  ComSpaceTiming: Common space timing structure
  * @param  AttSpaceTiming: Attribute space timing structure
  * @param  IOSpaceTiming: IO space timing structure
  * @retval HAL status
  */
StatusType PCCARD_Init(PCCARD_HandleType *hpccard, xmc_nand_pccard_timinginit_type *ComSpaceTiming, xmc_nand_pccard_timinginit_type *AttSpaceTiming, xmc_nand_pccard_timinginit_type *IOSpaceTiming)
{
  gpio_init_type  GPIO_InitStructure;
  uint8_t Set_reg_8_bit;

  /* Check the PCCARD controller state */
  if(hpccard == NULL)
  {
    return STATUS_ERROR;
  }

 if(hpccard->CF.Enable_8_bit_mode == TRUE)
  Set_reg_8_bit = 1;
 else
  Set_reg_8_bit = 0;


  if(hpccard->State == PCCARD_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hpccard->Lock = UNLOCKED;

  }

  /* Initialize the PCCARD state */
  hpccard->State = PCCARD_STATE_BUSY;


  crm_periph_clock_enable(CRM_GPIOD_PERIPH_CLOCK,TRUE);
  crm_periph_clock_enable(CRM_GPIOE_PERIPH_CLOCK,TRUE);
  crm_periph_clock_enable(CRM_GPIOF_PERIPH_CLOCK,TRUE);
  crm_periph_clock_enable(CRM_GPIOG_PERIPH_CLOCK,TRUE);
  /* address line:PF0 PF1 PF2 PF3 PF4 PF5 PF12 PF13 PF14 PF15 PG0 */
  
  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_0|GPIO_PINS_1|GPIO_PINS_2|GPIO_PINS_3|GPIO_PINS_4|GPIO_PINS_5|GPIO_PINS_12|GPIO_PINS_13|GPIO_PINS_14|GPIO_PINS_15; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOF, &GPIO_InitStructure);
  
  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_0; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOG, &GPIO_InitStructure);

  /* data line:   PD14 PD15 PD0 PD1 PE7 PE8 PE9 PE10 PE11 PE12 PE13 PE14 PE15 PD8 PD9 PD10 */

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_14|GPIO_PINS_15|GPIO_PINS_0|GPIO_PINS_1|GPIO_PINS_8|GPIO_PINS_9|GPIO_PINS_10; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOD, &GPIO_InitStructure);

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_11|GPIO_PINS_12|GPIO_PINS_13|GPIO_PINS_14|GPIO_PINS_15|GPIO_PINS_7|GPIO_PINS_8|GPIO_PINS_9|GPIO_PINS_10; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOE, &GPIO_InitStructure);

  /* XMC_NCE4_1/XMC_NCE4_2:PG10/PG11 XMC_NOE:PD4 XMC_NWE:PD5  XMC_NWAIT:PD6 */
  /* XMC_NIORD:PF6  XMC_NIOWR:PF8   XMC_NREG:PF7   XMC_INTR:PF10  XMC_CD:PF9  XMC_NIOS16:PF11 */

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_4|GPIO_PINS_6|GPIO_PINS_5; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_UP;
  gpio_init(GPIOD, &GPIO_InitStructure);

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_6; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOD, &GPIO_InitStructure);

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_10|GPIO_PINS_11; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOG, &GPIO_InitStructure);

  gpio_default_para_init(&GPIO_InitStructure);
  GPIO_InitStructure.gpio_pins = GPIO_PINS_9|GPIO_PINS_6|GPIO_PINS_7|GPIO_PINS_8|GPIO_PINS_10|GPIO_PINS_11; 
  GPIO_InitStructure.gpio_drive_strength = GPIO_DRIVE_STRENGTH_MODERATE;
  GPIO_InitStructure.gpio_mode = GPIO_MODE_MUX;
  GPIO_InitStructure.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  GPIO_InitStructure.gpio_pull = GPIO_PULL_NONE;
  gpio_init(GPIOF, &GPIO_InitStructure);

  /* Initialize PCCARD control Interface */
  XMC_PCCARD_InitCtrl(hpccard->Instance, &(hpccard->Init), Set_reg_8_bit);

  /* Init PCCARD common space timing Interface */
  XMC_PCCARD_InitCommonSpaceTiming(hpccard->Instance, ComSpaceTiming);

  /* Init PCCARD attribute space timing Interface */
  XMC_PCCARD_InitAttributeSpaceTiming(hpccard->Instance, AttSpaceTiming);

  /* Init PCCARD IO space timing Interface */
  XMC_PCCARD_InitIOSpaceTiming(hpccard->Instance, IOSpaceTiming);

  /* Enable the PCCARD device */
  xmc_pccard_enable(TRUE);

  /* Update the PCCARD state */
  hpccard->State = PCCARD_STATE_READY;

  return STATUS_OK;

