ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  return TRUE;
}


/**
  * @brief  Erase sector from PCCARD memory
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Address: Sector address to erase
  * @retval HAL status
  */
BOOL PCCARD_Erase_Sector(PCCARD_HandleType *hpccard, uint32_t Sector_Address, uint32_t Sector_Count)
{
  uint8_t Reg;
  uint16_t Count = 0;

  while (Count < Sector_Count)
  {

    Translate_CHSAddr(hpccard, Sector_Address, 0, Sector_Count);
    Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

    *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder >> 8);
    *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder);
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_NUMBER) = hpccard->CF.CFAddr.Sector;
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

    if(CF_SendCommand(hpccard, ATA_ERASE_SECTOR_CMD))
    {
      Count += hpccard->CF.CFAddr.Sector_Count;
      Sector_Address += hpccard->CF.CFAddr.Sector_Count;
    }

    while(1)
    {
      if(TaskFileRegIsValid(hpccard))
      {
        if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT))
        {
          break;
        }
        else if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
        {
          return FALSE;
        }
      }
    }
  }

  return TRUE;
}
/**
  * @brief  Diagnostic
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Diagnostic(PCCARD_HandleType *hpccard)
{
  uint8_t ERROR_REG;

  /* Set the parameters */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_EXECUTE_DRIVE_DIAG_CMD))
  {
    return FALSE;
  }

  ERROR_REG = PCCARD_Read_ERROR_REG(hpccard);

  if((ERROR_REG == 0x01) || (ERROR_REG == 0x02) || (ERROR_REG == 0x03) || (ERROR_REG == 0x04) || (ERROR_REG == 0x05) || (ERROR_REG == 0x80))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Check Power Mode
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Check_Power_Mode(PCCARD_HandleType *hpccard)
{
  uint8_t SECTOR_COUNT_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_CHECK_POWER_MODE_CMD))
  {
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0xFF || SECTOR_COUNT_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Set idle 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Count: the sector count 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Idle(PCCARD_HandleType *hpccard, uint32_t Sector_Count)
{
  uint8_t SECTOR_COUNT_REG;

  hpccard->CF.CFAddr.Sector_Count = Sector_Count;

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_IDLE_CMD))
  {
    return FALSE;
  }


  /* Check Power Mode */
  if(!PCCARD_Check_Power_Mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0xFF)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Idle immediate 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Idle_Immediate(PCCARD_HandleType *hpccard)
{
  uint8_t SECTOR_COUNT_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_IDLE_IMMEDIATE_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!PCCARD_Check_Power_Mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0xFF)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Set sleep mode 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Set_Sleep_Mode(PCCARD_HandleType *hpccard)
{
  uint8_t SECTOR_COUNT_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_SET_SLEEP_MODE_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!PCCARD_Check_Power_Mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Set Standby 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Standby(PCCARD_HandleType *hpccard)
{
  uint8_t SECTOR_COUNT_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

