ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_STANDBY_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!PCCARD_Check_Power_Mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Standby Immediate 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Standby_Immediate(PCCARD_HandleType *hpccard)
{
  uint8_t SECTOR_COUNT_REG;
  /* set sector_count register 0x80, after check_power_mode */
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = 0x80;    
  /* the register will be change to 0x00 or 0xFF */

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_STANDBY_IMMEDIATE_CMD))
  {
    return FALSE;
  }

  /* Check Power Mode */
  if(!PCCARD_Check_Power_Mode(hpccard))
  {
    printf("Compact Flash Check Power Mode Failed \n");
    return FALSE;
  }

  SECTOR_COUNT_REG =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT);

  if(SECTOR_COUNT_REG == 0x00)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Reuqest Sense the pccard 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Reuqest_Sense(PCCARD_HandleType *hpccard)
{
  uint8_t Reg, ERROR_REG;

  Reg = hpccard->CF.CFAddr.Drv | 0xA0;

  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

  if(!CF_SendCommand(hpccard, ATA_REQUEST_SENSE_CMD))
  {
    return FALSE;
  }

  ERROR_REG = PCCARD_Read_ERROR_REG(hpccard);

  if((ERROR_REG == 0x2F) || (ERROR_REG == 0x21))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Recalibrate the pccard 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Recalibrate(PCCARD_HandleType *hpccard)
{
  uint8_t Reg, ERROR_REG;

  Reg = hpccard->CF.CFAddr.Drv | 0xA0;

  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

  if(!CF_SendCommand(hpccard, ATA_RECALIBRATE_CMD))
  {
    return FALSE;
  }

  ERROR_REG = PCCARD_Read_ERROR_REG(hpccard);

  if((0x00 == ERROR_REG))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  Init drive para 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Count: the sector count 
  * @param  Head_Count: the head count.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Init_Drive_Para(PCCARD_HandleType *hpccard, uint16_t Sector_Count, uint8_t Head_Count)
{
  uint8_t Reg;

  hpccard->CF.CFAddr.Head = (uint8_t)Head_Count;
  hpccard->CF.CFAddr.Sector_Count = (uint8_t)Sector_Count;

  Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv;

  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

  if(!CF_SendCommand(hpccard, ATA_INIT_DRIVE_PARA_CMD))
  {
    return FALSE;
  }

  return TRUE;
}
/**
  * @brief  seek pccard 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Head_Count: the head count.
  * @param  Cylinder_Count: the cylinder count 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Seek(PCCARD_HandleType *hpccard, uint8_t Head_Count, uint16_t Cylinder_Count)
{
  uint8_t Reg, ERROR_REG;

  hpccard->CF.CFAddr.Head = (uint8_t)Head_Count;
  hpccard->CF.CFAddr.Cylinder = (uint16_t)Cylinder_Count;

  Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder >> 8);
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder);

  /* This command should return false */
  if(CF_SendCommand(hpccard, ATA_SEEK_CMD)) 
  {
    return FALSE;
  }

  ERROR_REG = PCCARD_Read_ERROR_REG(hpccard);

  if((ERROR_REG != 0x00))
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  format track 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @param  Sector_Address: the sector addr 
  * @param  Sector_Count: the sector count 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Format_Track(PCCARD_HandleType *hpccard, uint8_t *pBuffer, uint32_t Sector_Address, uint32_t Sector_Count)
{
  uint16_t Count = 0;
  uint8_t  Reg;

  if(Sector_Count == 0)
  {
    Sector_Count = 256;
  }

  while(Count < Sector_Count)
  {
    /* Set the parameters to write a sector */
    Translate_CHSAddr(hpccard, Sector_Address, Count, Sector_Count);
    Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

    *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder >> 8);
    *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder);
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_NUMBER) = hpccard->CF.CFAddr.Sector;
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

    if(CF_SendCommand(hpccard, ATA_FORMAT_TRACK_CMD))
    {
      while(1)
      {
        if(TaskFileRegIsValid(hpccard))
        {
          if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
          {
           // Write_Sector(hpccard, pBuffer, PCCARD_SECTOR_SIZE);

            Sector_Address += 1;
            Count += 1;

