ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  return TRUE;
}
/**
  * @brief  set multiple mode 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Count: the sector count 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Set_Multiple_Mode(PCCARD_HandleType *hpccard, uint32_t Sector_Count)
{
  hpccard->CF.CFAddr.Sector_Count = Sector_Count;

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(!CF_SendCommand(hpccard, ATA_SET_MULTIPLE_MODE_CMD))
  {
    return FALSE;
  }

  return TRUE;
}
/**
  * @brief  set features 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Count: the sector count 
  * @param  Feature: Feature val
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Set_Features(PCCARD_HandleType *hpccard, uint32_t Sector_Count, uint8_t Feature)
{
  hpccard->CF.CFAddr.Sector_Count = Sector_Count;

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_FEATURE_REG)   = Feature;

  if(!CF_SendCommand(hpccard, ATA_SET_FEATURE_CMD))
  {
    return FALSE;
  }

  return TRUE;
}
/**
  * @brief  read buffer 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Read_Buffer(PCCARD_HandleType *hpccard, uint8_t *pBuffer)
{
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(CF_SendCommand(hpccard, ATA_READ_BUFFER_CMD))
  {
    if (TaskFileRegIsValid(hpccard))
    {
      if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        Read_Sector(hpccard, pBuffer, PCCARD_SECTOR_SIZE);
      }
      else if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
      {
        return FALSE;
      }
    }
  }

  while(1)
  {
    if(TaskFileRegIsValid(hpccard))
    {
      if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
      {
        break;
      }
      else if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

  return TRUE;
}
/**
  * @brief  write buffer 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Write_Buffer(PCCARD_HandleType *hpccard, uint8_t *pBuffer)
{
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = hpccard->CF.CFAddr.Drv;

  if(CF_SendCommand(hpccard, ATA_WRITE_BUFFER_CMD))
  {
    if (TaskFileRegIsValid(hpccard))
    {
      if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        Write_Sector(hpccard, pBuffer, PCCARD_SECTOR_SIZE);
      }
      else if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
      {
        return FALSE;
      }
    }
  }

  while(1)
  {
    if(TaskFileRegIsValid(hpccard))
    {
      if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT))
      {
        break;
      }
      else if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

  return TRUE;
}
/**
  * @brief  Translate sector 
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Address: the sector addr 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Translate_Sector(PCCARD_HandleType *hpccard, uint32_t Sector_Address)
{
  uint32_t Total_Cylinder;
  uint8_t Reg;

  Total_Cylinder = (uint32_t)(hpccard->CF.CFCardInfo.Default_Head * hpccard->CF.CFCardInfo.Default_Sector); // The total sectors in one cylinder

  hpccard->CF.CFAddr.Cylinder  = (uint16_t)(Sector_Address / Total_Cylinder);
  hpccard->CF.CFAddr.Head      = (uint8_t)((Sector_Address % Total_Cylinder) / hpccard->CF.CFCardInfo.Default_Sector);
  hpccard->CF.CFAddr.Sector    = (uint8_t)((Sector_Address % Total_Cylinder) % hpccard->CF.CFCardInfo.Default_Sector) + 1;

  /* Set the parameters to write a sector */
  Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder >> 8);
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder);
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_NUMBER) = hpccard->CF.CFAddr.Sector;
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

  if(!CF_SendCommand(hpccard, ATA_TRANSLATE_SECTOR_CMD))
  {
    return FALSE;
  }

  return TRUE;
}
/**
  * @brief  write sector WO_ERASE
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @param  Sector_Address: the sector addr 
  * @param  Sector_Count: the sector count 
  * @retval TRUE or FALSE.
  */
BOOL PCCARD_Write_Sector_WO_ERASE(PCCARD_HandleType *hpccard, uint8_t *pBuffer, uint32_t Sector_Address, uint32_t Sector_Count)
{
  uint16_t Count = 0;
  uint8_t  Reg;

  if(Sector_Count == 0)
  {
    Sector_Count = 256;
  }

  while(Count < Sector_Count)
  {
    /* Set the parameters to write a sector */
    Translate_CHSAddr(hpccard, Sector_Address, Count, Sector_Count);
    Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

