ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  Total_Cylinder = (uint32_t)(hpccard->CF.CFCardInfo.Default_Head * hpccard->CF.CFCardInfo.Default_Sector); // The total sectors in one cylinder

  hpccard->CF.CFAddr.Cylinder  = (uint16_t)(Sector_Address / Total_Cylinder);
  hpccard->CF.CFAddr.Head      = (uint8_t)((Sector_Address % Total_Cylinder) / hpccard->CF.CFCardInfo.Default_Sector);
  hpccard->CF.CFAddr.Sector    = (uint8_t)((Sector_Address % Total_Cylinder) % hpccard->CF.CFCardInfo.Default_Sector) + 1;
  hpccard->CF.CFAddr.Sector_Count = 1;  //  some CF storage card implement the read long sector command as read sector commend
  //  set sector count to 1, after read 512 byte data, if the DRQ_BIT still high, means the
  //  read long sector command is work well, because it shoult return 516 byte data (ECC).


  Reg = hpccard->CF.CFAddr.Head | hpccard->CF.CFAddr.Drv | 0xA0;

  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_HIGH) = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder >> 8);
  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_CYLINDER_LOW)  = (uint8_t)(0xFF & hpccard->CF.CFAddr.Cylinder);
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_NUMBER) = hpccard->CF.CFAddr.Sector;
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_SECTOR_COUNT)  = hpccard->CF.CFAddr.Sector_Count;
  *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_CARD_HEAD)     = Reg;

  if(CF_SendCommand(hpccard, ATA_WRITE_LONG_SECTOR_CMD))
  {
    if(TaskFileRegIsValid(hpccard))
    {
      if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
      {
        Write_Sector(hpccard, pBuffer, PCCARD_SECTOR_SIZE);

        if(PCCARD_Read_STATUS_REG(hpccard) & DRQ_BIT)
        {
          for(index = 0; index < 4; index++)
          {
            *(uint8_t *)(hpccard->CF.IOAddr) = *(uint8_t *)pBuffer++;
          }
        }
        else
        {
          command_vaild = FALSE;
        }

        if(PCCARD_Read_STATUS_REG(hpccard) & DRQ_BIT)
        {
          command_vaild = FALSE;
        }

        else if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
        {
          return FALSE;
        }
      }
    }
  }

  while(1)
  {
    if(TaskFileRegIsValid(hpccard))
    {
      if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT))
      {
        break;
      }
      else if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        return FALSE;
      }
    }
  }

  if(command_vaild == TRUE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}
/**
  * @brief  read sector
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @param  Transfer_Size: the data length.
  * @retval pointer to the data buffer after read.
  */
uint8_t *Read_Sector(PCCARD_HandleType *hpccard, uint8_t *pBuffer, uint32_t Transfer_Size)
{
  uint32_t index = 0;

  XMC_Enable_16bit_Feature(hpccard->Instance, &(hpccard->Init), hpccard->CF.Enable_8_bit_mode);

  if(hpccard->CF.DMAEnable == TRUE)
  {
    if(hpccard->CF.Enable_8_bit_mode)
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)hpccard->CF.IOAddr, (uint32_t)pBuffer, Transfer_Size, Read_Transfer, Enable_8_bit_Transfer);
    }
    else
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)hpccard->CF.IOAddr, (uint32_t)pBuffer, (Transfer_Size / 2), Read_Transfer, Enable_16_bit_Transfer);
    }

    while(1)
    {
      if(dma_flag_get(DMA1_FDT1_FLAG) != RESET)
      {
        dma_flag_clear(DMA1_FDT1_FLAG);
        break;
      }
    }

    pBuffer += 512;
  }
  else
  {
    if(hpccard->CF.Enable_8_bit_mode)
    {
      for(; index < (Transfer_Size) ; index++)
      {
        *(uint8_t *)pBuffer++ = *(uint8_t *)(hpccard->CF.IOAddr);
      }
    }
    else
    {
      for(; index < (Transfer_Size / 2); index++)
      {
        *(uint16_t *)pBuffer = *(uint16_t *)(hpccard->CF.IOAddr);
       /* offset to next 16 bit */
        pBuffer += 2;  
      }
    }
  }

  XMC_Enable_16bit_Feature(hpccard->Instance, &(hpccard->Init), 1);
  return pBuffer;
}
/**
  * @brief  write sector
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  pBuffer: pointer to the data buffer.
  * @param  Transfer_Size: the data length.
  * @retval pointer to the data buffer after write.
  */
uint8_t *Write_Sector(PCCARD_HandleType *hpccard, uint8_t *pBuffer, uint32_t Transfer_Size)
{
  uint32_t index = 0;

  XMC_Enable_16bit_Feature(hpccard->Instance, &(hpccard->Init), hpccard->CF.Enable_8_bit_mode);

  if(hpccard->CF.DMAEnable == TRUE)
  {
    if(hpccard->CF.Enable_8_bit_mode)
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)pBuffer, (uint32_t)hpccard->CF.IOAddr, Transfer_Size, Write_Transfer, Enable_8_bit_Transfer);
    }
    else
    {
      MYDMA_Config(DMA1_CHANNEL1, (uint32_t)pBuffer, (uint32_t)hpccard->CF.IOAddr, (Transfer_Size / 2), Write_Transfer, Enable_16_bit_Transfer);
    }

    while(1)
    {
      if(dma_flag_get(DMA1_FDT1_FLAG) != RESET)  
      {
        dma_flag_clear(DMA1_FDT1_FLAG);
        break;
      }
    }

    pBuffer += 512;
  }
  else
  {
    if(hpccard->CF.Enable_8_bit_mode)
    {
      for(; index < (Transfer_Size); index++)
      {
        *(uint8_t *)(hpccard->CF.IOAddr) = *(uint8_t *)pBuffer++;
      }
    }
    else
    {
      for(; index < (Transfer_Size / 2); index++)
      {
        *(uint16_t *)(hpccard->CF.IOAddr) = *(uint16_t *)pBuffer;
        /* offset to next 16 bit */
        pBuffer += 2;  // offset to next 16 bit
      }
    }
  }

  XMC_Enable_16bit_Feature(hpccard->Instance, &(hpccard->Init), 1);
  return pBuffer;
}

/**
  * @brief  Reset the PCCARD memory
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval HAL status
  */
BOOL PCCARD_Reset(PCCARD_HandleType *hpccard)
{
  /* Provide an SW reset and Read and verify the:
   - CF Configuration Option Register at address 0x98000200 --> 0x80
   - Card Configuration and Status Register at address 0x98000202 --> 0x00
   - Pin Replacement Register  at address 0x98000204 --> 0x0C
   - Socket and Copy Register at address 0x98000206 --> 0x00
  */

  uint8_t config_option_reg;

