ArteryTek/AT32F403_Firmware_Library/project/at_start_f403/examples/xmc/pc_card/pc_card/cf.c
  /* Set up the Reset bit in config option register */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = 0x80;
  delay_ms(100);
  /* Clear the Reset bit in config option register */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = 0x00;
  delay_ms(100);
  /* Set the PC card I/O configurations */
  *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG) = hpccard->CF.Protocol;
  delay_ms(100);

  config_option_reg = *(__IO uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | CONFIG_OPTION_REG);

  if(config_option_reg == hpccard->CF.Protocol)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * Translate_CHSAddr:
  *  translate DISK sector number to C.H.S address.
  *  input  : CFCard
  *        Start (Start sector number)
  *        Sector_Count (sector count which read from CF card)
  *        Sector_Limit (maximum sector number)
  *  output  : None
  */
void Translate_CHSAddr(PCCARD_HandleType *hpccard, uint32_t Start, uint16_t Sector_Count, uint16_t Sector_Limit)
{
  uint32_t Total_Cylinder;
  uint16_t Prev_Count;

  Prev_Count = (Sector_Limit / hpccard->CF.CFCardInfo.Default_Sector) * hpccard->CF.CFCardInfo.Default_Sector;

  Total_Cylinder = (uint32_t)(hpccard->CF.CFCardInfo.Default_Head * hpccard->CF.CFCardInfo.Default_Sector); // The total sectors in one cylinder

  hpccard->CF.CFAddr.Cylinder  = (uint16_t)(Start / Total_Cylinder);
  hpccard->CF.CFAddr.Head      = (uint8_t)((Start % Total_Cylinder) / hpccard->CF.CFCardInfo.Default_Sector);
  hpccard->CF.CFAddr.Sector    = (uint8_t)((Start % Total_Cylinder) % hpccard->CF.CFCardInfo.Default_Sector) + 1;

  if ((Prev_Count <= Sector_Count) && (Sector_Count <= Sector_Limit))
  {
    hpccard->CF.CFAddr.Sector_Count = (uint8_t)(Sector_Limit % hpccard->CF.CFCardInfo.Default_Sector);
  }
  else
  {
    hpccard->CF.CFAddr.Sector_Count = (uint8_t)hpccard->CF.CFCardInfo.Default_Sector;
  }
}

/**
  * @brief  Read CIS Information.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL ReadCFCardCISInformation(PCCARD_HandleType *hpccard)
{
  uint8_t CIS_1, CIS_2, CIS_3;

  CIS_1 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x0);
  CIS_2 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x2);
  CIS_3 = *(uint8_t *)(PCCARD_ATTRIBUTE_SPACE_ADDRESS | 0x4);

  if(CIS_1 == 0x1 && CIS_2 == 0x4 && CIS_3 == 0xdf)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/**
  * @brief  Send command.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Cmd: the command value
  * @retval TRUE or FALSE.
  */
BOOL CF_SendCommand(PCCARD_HandleType *hpccard, uint8_t Cmd)
{
  uint8_t Reg;

  do
  {
    *(__IO uint8_t  *)(hpccard->CF.IOAddr | ATA_STATUS_CMD) = Cmd;

    while(!TaskFileRegIsValid(hpccard)) ;

    Reg = PCCARD_Read_STATUS_REG(hpccard);

    if ((Reg & ERR_BIT) != 0)
    {
      return FALSE;
    }
  }
  while((Reg & RDY_BIT) == 0);

  return TRUE;
}
/**
  * @brief  Check the PCCARD TaskFileReg valid.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval TRUE or FALSE.
  */
BOOL TaskFileRegIsValid(PCCARD_HandleType *hpccard)
{
  uint8_t status = 0;

  status = PCCARD_Read_STATUS_REG(hpccard);

  if(status & BUSY_BIT)
  {
    return FALSE;
  }

  return TRUE;
}
/**
  * @brief  Check the PCCARD info valid.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @param  Sector_Count: sector count
  * @param  Head_Count:head count
  * @retval TRUE or FALSE.
  */
BOOL Vaild_Init_Drive_Para(PCCARD_HandleType *hpccard, uint16_t Sector_Count, uint8_t Head_Count)
{
  uint8_t CardInfo[PCCARD_SECTOR_SIZE * sizeof(uint8_t)] = {0};

  memset(CardInfo, 0, PCCARD_SECTOR_SIZE * sizeof(uint8_t));

  if(PCCARD_Identify(hpccard))
  {
    while(1)
    {
      if(TaskFileRegIsValid(hpccard))
      {
        if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | DRQ_BIT))
        {
          Read_Sector(hpccard, CardInfo, PCCARD_SECTOR_SIZE);
          break;
        }
        else if(PCCARD_Read_STATUS_REG(hpccard) == (RDY_BIT | DSC_BIT | ERR_BIT))
        {
          printf("\r\nCommand Pass, but ERR bit is high");
          printf("\r\nCF Status Reg=%#x", PCCARD_Read_STATUS_REG(hpccard));
          printf("\r\nCF Error  Reg=%#x", PCCARD_Read_ERROR_REG(hpccard));
          return FALSE;
        }
      }
    }
  }

  while(1)
  {
    if(TaskFileRegIsValid(hpccard))
    {
      if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x50)
      {
        break;
      }
      else if((PCCARD_Read_STATUS_REG(hpccard) & (RDY_BIT | DSC_BIT | ERR_BIT)) == 0x51)
      {
        printf("\r\nSend Command Failed");
        printf("\r\nCF Status Reg=%#x", PCCARD_Read_STATUS_REG(hpccard));
        printf("\r\nCF Error  Reg=%#x", PCCARD_Read_ERROR_REG(hpccard));
        return FALSE;
      }
    }
  }

  if (((uint16_t)CardInfo[0] | (uint16_t)CardInfo[1] << 8) == 0x848A && ((uint16_t)CardInfo[110] | \
      (uint16_t)CardInfo[111] << 8) ==  Head_Count && ((uint16_t)CardInfo[112] | (uint16_t)CardInfo[113] << 8) ==  Sector_Count )
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }

}
/**
  * @brief  printf the verification result.
  * @param  result: pointer to a verification_result structure that contains
  *                various kinds of verification.
  * @retval None.
  */
void show_verification_result(verification_result_struct *result)
{
  printf("\r\n");
  printf("\r\n----------------------------------------------------------------------");
  printf("\r\n%s    %-6s   ", "ATTRIBUTE_RW_PASS      ", ((result->ATTRIBUTE_RW_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "READ_ATTRIBUTE_CIS     ", ((result->CIS_READ_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "IDENTIFY_DRIVE         ", ((result->ATA_IDENTIFY_DRIVE_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "EXECUTE_DRIVE_DIAG     ", ((result->ATA_EXECUTE_DRIVE_DIAG_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "WRITE_SECTOR           ", ((result->ATA_WRITE_SECTOR_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "READ_SECTOR            ", ((result->ATA_READ_SECTOR_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n%s    %-6s   ", "ACESS_25_SECTORS       ", ((result->ACESS_25_SECTORS_PASS) ? " PASS" : "FAILED *****"));
  printf("\r\n----------------------------------------------------------------------");
  printf("\r\n\r\n");
}


/**
  * @brief  This function handles PCCARD device interrupt request.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval HAL status
  */
void PCCARD_IRQHandler(PCCARD_HandleType *hpccard)
{
}


/**
  * @}
  */

/** @defgroup PCCARD_Exported_Functions_Group3 Peripheral State functions
 *  @brief   Peripheral State functions
 *
@verbatim
  ==============================================================================
                   ##### PCCARD Peripheral State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the PCCARD controller
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  return the PCCARD controller state
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval HAL state
  */
PCCARD_StateType PCCARD_GetState(PCCARD_HandleType *hpccard)
{
  return hpccard->State;
}
/**
  * @brief  Get the PCCARD error reg value.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval reg: error reg value.
  */
uint8_t PCCARD_Read_ERROR_REG(PCCARD_HandleType *hpccard)
{
  uint8_t Reg = 0;

  /* Read ERROR Reg operation */
  Reg =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_ERROR_REG);
  CF_print(ERR_REG_INFO, ("\r\nCF card ERROR Register value is %#x", Reg));
  return Reg;
}
/**
  * @brief  Get the PCCARD status reg value.
  * @param  hpccard: pointer to a PCCARD_HandleType structure that contains
  *                the configuration information for PCCARD module.
  * @retval reg: status reg value.
  */
uint8_t PCCARD_Read_STATUS_REG(PCCARD_HandleType *hpccard)
{
  uint8_t Reg = 0;

  /* Read STATUS Reg operation */
  Reg =  *(__IO uint8_t *)(hpccard->CF.IOAddr | ATA_STATUS_CMD);
  CF_print(STS_REG_INFO, ("\r\nCF card STATUS Register value is %#x", Reg));

  return Reg;
}


void XMC_IRQHandler(void)
{
  __nop();
}

/**
  * @}
  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */












